tyrigi/ESP32-Keypad/lib/ESP32-BLE-Sherbet/BleSherbet.cpp
  END_COLLECTION(0),         //     END_COLLECTION (Physical)
  END_COLLECTION(0)          //     END_COLLECTION (Application)*/

BleKeypad::BleKeypad(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel) : 
	hid(0), 
	_buttons(0),
	_x(0),
  	_y(0),
  	_z(0),
  	_rZ(0),
  	_rX(0),
  	_rY(0),
  	_hat(0),
  	_autoReport(false)
{
  this->deviceName = deviceName;
  this->deviceManufacturer = deviceManufacturer;
  this->batteryLevel = batteryLevel;
  this->connectionStatus = new BleConnectionStatus();
}

void BleKeypad::begin(bool autoReport)
{
  Serial.begin(115200);
  _autoReport = autoReport;
  xTaskCreate(this->taskServer, "server", 20000, (void *)this, 5, NULL);
  //reset();
}

void BleKeypad::end(void)
{
}

bool BleKeypad::isConnected(void) {
  return this->connectionStatus->connected;
}

void BleKeypad::setBatteryLevel(uint8_t level) {
  this->batteryLevel = level;
  if (hid != 0)
    this->hid->setBatteryLevel(this->batteryLevel);
}

void BleKeypad::taskServer(void* pvParameter) {
  BleKeypad* bleKeypadInstance = (BleKeypad *) pvParameter; //static_cast<BleKeyboard *>(pvParameter);
  BLEDevice::init(bleKeypadInstance->deviceName);
  BLEServer *pServer = BLEDevice::createServer();
  pServer->setCallbacks(bleKeypadInstance->connectionStatus);

  bleKeypadInstance->hid = new BLEHIDDevice(pServer);
  bleKeypadInstance->inputKeyboard = bleKeypadInstance->hid->inputReport(KEYBOARD_ID); // <-- input REPORTID from report map
  bleKeypadInstance->outputKeyboard = bleKeypadInstance->hid->outputReport(KEYBOARD_ID);
  bleKeypadInstance->inputMediaKeys = bleKeypadInstance->hid->inputReport(MEDIA_KEYS_ID);
  bleKeypadInstance->inputGamepad = bleKeypadInstance->hid->inputReport(GAMEPAD_ID);
  bleKeypadInstance->connectionStatus->inputKeyboard = bleKeypadInstance->inputKeyboard;
  bleKeypadInstance->connectionStatus->outputKeyboard = bleKeypadInstance->outputKeyboard;
  bleKeypadInstance->connectionStatus->inputMediaKeys = bleKeypadInstance->inputMediaKeys;
  bleKeypadInstance->connectionStatus->inputGamepad = bleKeypadInstance->inputGamepad;

  bleKeypadInstance->outputKeyboard->setCallbacks(new KeypadOutputCallbacks());

  bleKeypadInstance->hid->manufacturer()->setValue(bleKeypadInstance->deviceManufacturer);

  bleKeypadInstance->hid->pnp(0x02, 0xe502, 0xa111, 0x0210);
  bleKeypadInstance->hid->hidInfo(0x00,0x01);

  BLESecurity *pSecurity = new BLESecurity();

  pSecurity->setAuthenticationMode(ESP_LE_AUTH_BOND);

  bleKeypadInstance->hid->reportMap((uint8_t*)_hidReportDescriptor, sizeof(_hidReportDescriptor));
  bleKeypadInstance->hid->startServices();

  bleKeypadInstance->onStarted(pServer);

  BLEAdvertising *pAdvertising = pServer->getAdvertising();
  pAdvertising->setAppearance(HID_GAMEPAD);
  pAdvertising->addServiceUUID(bleKeypadInstance->hid->hidService()->getUUID());
  pAdvertising->setScanResponse(false);
  pAdvertising->start();
  bleKeypadInstance->hid->setBatteryLevel(bleKeypadInstance->batteryLevel);

  ESP_LOGD(LOG_TAG, "Advertising started!");
  vTaskDelay(portMAX_DELAY); //delay(portMAX_DELAY);
}

void BleKeypad::sendReport(KeyReport* keys)
{
  if (this->isConnected())
  {
    this->inputKeyboard->setValue((uint8_t*)keys, sizeof(KeyReport));
    this->inputKeyboard->notify();
  }
}

void BleKeypad::sendReport(MediaKeyReport* keys)
{
  if (this->isConnected())
  {
    this->inputMediaKeys->setValue((uint8_t*)keys, sizeof(MediaKeyReport));
    this->inputMediaKeys->notify();
  }
}

void BleKeypad::sendReport(void)
{
	if (this->isConnected())
	{
		uint8_t m[15];
		m[0] = _buttons;
		m[1] = (_buttons >> 8);
		m[2] = (_buttons >> 16);
		m[3] = (_buttons >> 24);
		m[4] = _x;
		m[5] = (_x >> 8);
		m[6] = _y;
		m[7] = (_y >> 8);
		m[8] = _z;
		m[9] = (_z >> 8);
		m[10] = _rZ;
		m[11] = (_rZ >> 8);
		m[12] = (signed char)(_rX - 128);
		m[13] = (signed char)(_rY - 128);
		m[14] = _hat;
		if (m[12] == -128) { m[12] = -127; }
		if (m[13] == -128) { m[13] = -127; }
		this->inputGamepad->setValue(m, sizeof(m));
		this->inputGamepad->notify();
    //Serial.print(m[5], HEX);
    //Serial.print(m[4], HEX);
    //Serial.print("X\n");
	}
}

uint8_t USBPutChar(uint8_t c);

// press() adds the specified key (printing, non-printing, or modifier)
// to the persistent key report and sends the report.  Because of the way
// USB HID works, the host acts like the key remains pressed until we
// call release(), releaseAll(), or otherwise clear the report and resend.
size_t BleKeypad::presskey(uint8_t k)
{
	uint8_t i;
  Serial.print("Pressing key ");
  Serial.print(k, HEX);
  Serial.print("\n");
    
	if (k >= 128 && k <= 135) {			// it's a modifier key
		_keyReport.modifiers |= (1<<k);
    k = 0;
    Serial.print("modifier key pressed\n");
	}

  if (k >= 0xE9){
    switch (k){
      case 0xE9: this->presskey(NEXT_TRACK);
      case 0xEA: this->presskey(PREVIOUS_TRACK);
      case 0xEB: this->presskey(MEDIA_STOP);
      case 0xEC: this->presskey(PLAY_PAUSE);
      case 0xED: this->presskey(MEDIA_MUTE);
      case 0xEE: this->presskey(VOLUME_UP);
      case 0xEF: this->presskey(VOLUME_DOWN);
    }
    Serial.print("Media Key Pressed\n");
  }

	// Add k to the key report only if it's not already present
	// and if there is an empty slot.
	if (_keyReport.keys[0] != k && _keyReport.keys[1] != k &&
		_keyReport.keys[2] != k && _keyReport.keys[3] != k &&
		_keyReport.keys[4] != k && _keyReport.keys[5] != k) {

		for (i=0; i<6; i++) {
			if (_keyReport.keys[i] == 0x00) {
				_keyReport.keys[i] = k;
				break;
			}
		}
		if (i == 6) {
			setWriteError();
			return 0;
		}
	}
	sendReport(&_keyReport);
  Serial.print("Keypress sent!\n");
	return 1;
}

size_t BleKeypad::presskey(const MediaKeyReport k)
{
    uint16_t k_16 = k[1] | (k[0] << 8);
    uint16_t mediaKeyReport_16 = _mediaKeyReport[1] | (_mediaKeyReport[0] << 8);

    mediaKeyReport_16 |= k_16;
    _mediaKeyReport[0] = (uint8_t)((mediaKeyReport_16 & 0xFF00) >> 8);
    _mediaKeyReport[1] = (uint8_t)(mediaKeyReport_16 & 0x00FF);

	sendReport(&_mediaKeyReport);
	return 1;
}

// release() takes the specified key out of the persistent key report and
// sends the report.  This tells the OS the key is no longer pressed and that
// it shouldn't be repeated any more.
size_t BleKeypad::releasekey(uint8_t k)
{
	uint8_t i;
  Serial.print("Releasing key ");
  Serial.print(k, HEX);
  Serial.print("\n");

	if (k >= 128 && k <= 135) {			// it's a modifier key
		_keyReport.modifiers &= ~(1<<k);
    k = 0;
    Serial.print("Modifier Key released\n");
	}

  if (k >= 0xE9){
    switch (k){
      case 0xE9: this->releasekey(NEXT_TRACK);
      case 0xEA: this->releasekey(PREVIOUS_TRACK);
      case 0xEB: this->releasekey(MEDIA_STOP);
      case 0xEC: this->releasekey(PLAY_PAUSE);
      case 0xED: this->releasekey(MEDIA_MUTE);
      case 0xEE: this->releasekey(VOLUME_UP);
      case 0xEF: this->releasekey(VOLUME_DOWN);
    }
    Serial.print("media key released\n");
  }

	// Test the key report to see if k is present.  Clear it if it exists.
	// Check all positions in case the key is present more than once (which it shouldn't be)
	for (i=0; i<6; i++) {
		if (0 != k && _keyReport.keys[i] == k) {
			_keyReport.keys[i] = 0x00;
		}
	}

	sendReport(&_keyReport);
  Serial.print("Rleased key sent!\n");
	return 1;
}

size_t BleKeypad::releasekey(const MediaKeyReport k)
{
    uint16_t k_16 = k[1] | (k[0] << 8);
    uint16_t mediaKeyReport_16 = _mediaKeyReport[1] | (_mediaKeyReport[0] << 8);
    mediaKeyReport_16 &= ~k_16;
    _mediaKeyReport[0] = (uint8_t)((mediaKeyReport_16 & 0xFF00) >> 8);
    _mediaKeyReport[1] = (uint8_t)(mediaKeyReport_16 & 0x00FF);

