tyrigi/ESP32-Keypad/lib/ESP32-BLE-Sherbet/BleSherbet.cpp
	sendReport(&_mediaKeyReport);
	return 1;
}

void BleKeypad::releaseAll(void)
{
	_keyReport.keys[0] = 0;
	_keyReport.keys[1] = 0;
	_keyReport.keys[2] = 0;
	_keyReport.keys[3] = 0;
	_keyReport.keys[4] = 0;
	_keyReport.keys[5] = 0;
	_keyReport.modifiers = 0;
    _mediaKeyReport[0] = 0;
    _mediaKeyReport[1] = 0;
	sendReport(&_keyReport);
}

size_t BleKeypad::write(uint8_t c)
{
	uint8_t p = presskey(c);  // Keydown
	releasekey(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeypad::write(const MediaKeyReport c)
{
	uint16_t p = presskey(c);  // Keydown
	releasekey(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeypad::write(const uint8_t *buffer, size_t size) {
	size_t n = 0;
	while (size--) {
		if (*buffer != '\r') {
			if (write(*buffer)) {
			  n++;
			} else {
			  break;
			}
		}
		buffer++;
	}
	return n;
}
//-----------------------------------------------------------------------------
// Gamepad methods
//-----------------------------------------------------------------------------
void BleKeypad::setAxes(int16_t x, int16_t y, int16_t z, int16_t rZ, char rX, char rY, signed char hat)
{
	if(x == -32768) { x = -32767; }
	if(y == -32768) { y = -32767; }
	if(z == -32768) { z = -32767; }
	if(rZ == -32768) { rZ = -32767; }

	_x = x;
	_y = y;
	_z = z;
	_rZ = rZ;
	_rX = rX;
	_rY = rY;
	_hat = hat;
	
	if(_autoReport){ sendReport(); }
}

void BleKeypad::buttons(uint32_t b)
{
  if (b != _buttons)
  {
    _buttons = b;
	
	if(_autoReport){ sendReport(); }
  }
}

void BleKeypad::press(uint32_t b)
{
  buttons(_buttons | b);
}

void BleKeypad::release(uint32_t b)
{
  buttons(_buttons & ~b);
}

void BleKeypad::setLeftThumb(int16_t x, int16_t y)
{
	_x = x;
	_y = y;
	
	if(_autoReport){ sendReport(); }
}
void BleKeypad::setRightThumb(int16_t z, int16_t rZ)
{
	_z = z;
	_rZ = rZ;
	
	if(_autoReport){ sendReport(); }
}

void BleKeypad::setLeftTrigger(char rX)
{
	_rX = rX;
	
	if(_autoReport){ sendReport(); }
}

void BleKeypad::setRightTrigger(char rY)
{
	_rY = rY;
	
	if(_autoReport){ sendReport(); }
}

void BleKeypad::setHat(signed char hat)
{
	_hat = hat;
	
	if(_autoReport){ sendReport(); }
}

void BleKeypad::setX(int16_t x)
{
	_x = x;
}

void BleKeypad::setY(int16_t y)
{
	_y = y;
}

void BleKeypad::setZ(int16_t z)
{
	_z = z;
}

void BleKeypad::setRZ(int16_t rZ)
{
	_rZ = rZ;
}

void BleKeypad::setRX(int16_t rX)
{
	_rX = rX;
}

void BleKeypad::setRY(int16_t rY)
{
	_rY = rY;
}

void BleKeypad::setAutoReport(bool autoReport)
{
	_autoReport = autoReport;
}

bool BleKeypad::isPressed(uint32_t b)
{
  if ((b & _buttons) > 0)
    return true;
  return false;
}